3mdeb/freebsd-src/usr.sbin/efitable/efitable.8
.\"
.\" Copyright (c) 2021 3mdeb.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd June 10, 2021
.Dt EFITABLE 8
.Os
.Sh NAME
.Nm efitable
.Nd UEFI tables interaction
.Sh SYNOPSIS
.Nm
.Op Fl u Ar uuid | Fl t Ar name 
.Op Fl j
.Sh DESCRIPTION
This program prints data from
.Dq Unified Extensible Firmware Interface
.Pq UEFI
tables.
.Pp
The following options are available:
.Bl -tag -width 20m
.It Fl t Ar name Fl -table Ar name
Specify the name of the table to print. Currently
supported tables: esrt (EFI System Resource Table),
prop (EFI Properties Table)
.It Fl u Ar uuid Fl -uuid Ar uuid
Specify the UUID of the table to print.
.It Fl j Fl -json
Print table content in JSON format
.El
.Sh HISTORY
The
.Nm
utility first appeared in
.Fx 14.0 .
